Открытый исходный код позволяет вам перейти на бесплатное программное обеспечение, но нет возможности присоединить ваш компьютер к остальному миру свободным способом.
Представьте, что вы являетесь полноправным участником в глобальной сети, без подписи
контракта с интернет-провайдерами. Представьте, что вы путешествуете в Сети, где 
нет центрального регулирующего органа, который назначает IP, условия, имена и суффиксы ...

Netsukuku, программное обеспечение с открытым исходным кодом, которое можно загрузить с
http://netsukuku.freaknet.org, позволяет создать новую распределённую глобальную сеть, которая может расширяться бесконечно, независимо от Интернета. Из-за особой маршрутизации Netsukuku, система, созданная группой «Freaknet» в Катании (Италия), 
устойчива благодаря всем пользователям Сети, которые делятся своими ресурсами ПК. У кого-то есть шанс присоединиться к Сети и, в то же время, чтобы другие пользователи сделали то же самое.
Таким образом, страны и районы земного шара, где Интернет по-прежнему недоступен, могут создавать и развивать Сеть через Wi-Fi, не представляя себя интернет-провайдерам или любым регулирующим центральным органам
